#include <iostream>
#include <iomanip>

using namespace std;
const int MAX_SIZE = 10;

int main() {
    setlocale(LC_ALL, "Bulgarian");
    int n;
    do {
        cout << "Въведете размера на A " <<
             "в интервала [1, " << MAX_SIZE << "]: ";
        cin >> n;
    } while (n < 0 || n > 10);
    int a[MAX_SIZE][MAX_SIZE];
    // Вивеждане на A
    int i, j;
    cout << "Въвеждане на" << n << " реда и на  "
         << n << " стълба на матрицата.\n";
    for (i = 0; i < n; i++)
        for (j = 0; j < n; j++) {
            cout << "a[" << i << "][" << j << "]=";
            cin >> a[i][j];
        }
    cout << "Извеждане по редове и стълбове:  \n";
    for (i = 0; i < n; i++) {
        for (j = 0; j < n; j++) {
            cout << a[i][j] << "\t";
        }
        cout << '\n';
    }
    /*
    cout << "1-Извеждане на елементите под главния диагонал:\n";
    for (i = 1; i < n; i++)
        for (j = 0; j < i; j++) {
            cout << "a[" << i << "][" << j << "]=" << a[i][j] << '\n';
        }
    cout << "1-Извеждане на елементите под главния диагонал:\n";
    for (i = 1; i < n; i++) {
        for (j = 0; j < i; j++) {
            cout << a[i][j] << "\t";
        }
        cout << '\n';
    }



    // Извежда главния диагонал с елемнтите под него
    cout << "2- Извежда главния диагонал с елемнтите под него  \n";
    for (i = 0; i < n; i++)
        for (j = 0; j <= i; j++) {
            cout << "a[" << i << "][" << j << "]=" << a[i][j] << '\n';
        }
    cout << "2- Извежда главния диагонал с елемнтите под него  \n";
    for (i = 0; i < n; i++) {
        for (j = 0; j <= i; j++) {
            cout << a[i][j] << "\t";
        }
        cout << '\n';
    }
    cout << "Извеждане по редове и стълбове:  \n";
    for (i = 0; i < n; i++) {
        for (j = 0; j < n; j++) {
            cout << a[i][j] << "\t";
        }
        cout << '\n';
    }



    cout << "3-Извеждане на главния диагонал \n";
    for (i = 0; i < n; i++)
        for (j = i; j <= i; j++) {
            cout << "a[" << i << "][" << j << "]=" << a[i][j] << '\n';
        }
    for (i = 0; i < n; i++) {
        for (j = i; j <= i; j++) {
            cout << setw((2 * j + 2 * i)) << a[i][j];
        }
        cout << '\n';
    }
    cout << "Извеждане по редове и стълбове: \n";
    for (i = 0; i < n; i++) {
        for (j = 0; j < n; j++) {
            cout << a[i][j] << "\t";
        }
        cout << '\n';
    }



    // Главния диагонал с елементите над него
    cout << "4 - Извежда главния диагонал с елементите над него \n";
    for (i = 0; i < n; i++) {
        for (j = i; j < n; j++) {
            cout << "a[" << i << "][" << j << "]=" << a[i][j] << '\n';
        }
    }
    cout << "4- Извежда главния диагонал с елементите над него \n";
    for (i = 0; i < n; i++) {
        for (j = i; j < n; j++) {
            cout << setw((2 * j + 2 * i)) << a[i][j];
        }
        cout << '\n';
    }
    cout << "Извеждане по редове и стълбове:  \n";
    for (i = 0; i < n; i++) {
        for (j = 0; j < n; j++) {
            cout << a[i][j] << "\t";
        }
        cout << '\n';
    }


    // Извежда елементите над главния диагонал
    cout << "1 Извежда елементите над главния диагонал \n";
    for (i = 0; i < n - 1; i++) {
        for (j = i + 1; j < n; j++) {
            cout << "a[" << i << "][" << j << "]=" << a[i][j] << '\n';
        }
    }

    cout << "2 Извежда елементите над главния диагонал \n";
    for (i = 0; i < n - 1; i++) {
        for (j = i + 1; j < n; j++) {
            cout << setw(2 * j + 2 * i) << a[i][j];
        }
        cout << '\n';
    }

    cout << "3 Извежда второстепенния диагонал  \n";
    for (i = 0; i < n; i++) {
        cout << setw(2 * j + 2 * i) << a[n - i - 1][i];
        cout << '\n';
    }
    cout << "4 Извежда второстепенния диагонал  \n";
    for (i = 0; i < n; i++) {
        cout << "a[" << n - i - 1 << "][" << i << "]="
             << a[n - i - 1][i] << '\n';
    }

    cout << "5 Извежда елементите под второстепенния диагонал \n";
    for (i = 1; i < n; i++) {
        for (j = n - i; j < n; j++) {
            cout << setw(2 * j + 2 * i) << a[i][j];
        }
        cout << '\n';
    }
    cout << "5 Извежда елементите под второстепенния диагонал\n";
    for (i = 1; i < n; i++) {
        for (j = n - i; j < n; j++) {
            cout << "a[" << i << "][" << j << "]=" << a[i][j] << '\n';
        }
    }

    cout << "6  Извежда второстепенния диагонал с елемнтите под него  \n";
    for (i = 0; i < n; i++) {
        for (j = n - i - 1; j < n; j++) {
            cout << setw(2 * j + 2 * i) << a[i][j];
        }
        cout << '\n';
    }
    cout << "6 Извежда второстепенния диагонал с елемнтите под него   \n";
    for (i = 0; i < n; i++) {
        for (j = n - i - 1; j < n; j++) {
            cout << "a[" << i << "][" << j << "]=" << a[i][j] << '\n';
        }
    }

     */


// Извежда главния диагонал с елементите над него
    cout << "1  Извежда главния диагонал с елементите над него \n";
    for (i = 0; i < n; i++) {
        for (j = i; j < n; j++) {
            cout << "a[" << i << "][" << j << "]=" << a[i][j] << '\n';
        }
    }
    cout << "2  Извежда главния диагонал с елементите над него \n";
    for (i = 0; i < n; i++) {

        for (j = i; j < n; j++) {
            cout << setw(2*i) << a[i][j];
        }
        cout << '\n';
    }
    cout << "3 Извеждане на главния диагонал  \n";
    for (i = 0; i < n; i++) {
        for (j = i; j <= i; j++) {
            cout << a[i][j] << "\t";
        }
        cout << '\n';
    }
    cout << "4 Извеждане на второстепенния диагонал  \n";
    for (i = 0; i < n; i++) {
        cout << a[n - i - 1][i] << "\t";
        cout << '\n';
    }
    cout << "4 Извеждане на второстепенния диагонал  \n";
    for (i = 0; i < n; i++) {
        cout << "a[" << n - i - 1 << "][" << i << "]="
             << a[n - i - 1][i] << '\n';
    }
    cout << "5 Извеждане на елементите под второстепенния диагонал \n";
    for (i = 1; i < n; i++) {
        for (j = n - i; j < n; j++) {
            cout << a[i][j] << "\t";
        }
        cout << '\n';
    }
    cout << "5 Извеждане на елементите под второстепенния диагонал \n";
    for (i = 1; i < n; i++) {
        for (j = n - i; j < n; j++) {
            cout << "a[" << i << "][" << j << "]=" << a[i][j] << '\n';
        }
    }
    cout << "6  Извеждане на второстепенния диагонал и елементите под него  \n";
    for (i = 0; i < n; i++) {
        for (j = n - i - 1; j < n; j++) {
            cout << a[i][j] << "\t";
        }
        cout << '\n';
    }
    cout << "6 Извеждане на второстепенния диагонал и елементите под него   \n";
    for (i = 0; i < n; i++) {
        for (j = n - i - 1; j < n; j++) {
            cout << "a[" << i << "][" << j << "]=" << a[i][j] << '\n';
        }
    }


    return 0;
}

